using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace FileManager
{
    internal class Class1
    {
    }
}


//. 문서화
//그래픽 표현은 엔지니어나 설계자가 정신적으로 작업하고 있기 때문에 아이 1.2.1 시각화
//디어의 영구적인 기록으로 유용합니다. 나중에 디자인 프로세스에서 모델이나 도
//면 형태의 보다 세련된 그래픽 표현을 사용하여 문제를 전달할 수 있습니다.
//2. 커뮤니케이션
//존재하지 않는 것을 정신적으로 상상하는 능력
//그래픽 표현은 개별 엔지니어와 설계자가 작업 중인 기술 문제에 대한 문제 
//해결에 사용됩니다(그림 1.6). 엔지니어의 경우 이 문제는 종종 초기 디자인에서 
//수정되거나 처음부터 생성되는 3D 개체일 수 있습니다. 이 문제 해결 프로세스
//의 일부는 비공식 도면이나 스케치를 사용하는 것일 수 있습니다. 이러한 유형의 
//도면은 역사적으로 연필과 종이로 작성되었지만 점차 컴퓨터 기반 스케치 및 모델
//링 도구를 사용하여 문제에 대한 솔루션에 대한 여러 아이디어를 신속하게 생성
//합니다.